bjjplan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-29 Tue 10:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brian Cronmiller" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org375b0f3">1. Guard</a>
<ul>
<li><a href="#orge23619d">1.1. Top</a></li>
<li><a href="#org98a10c6">1.2. Bottom</a></li>
</ul>
</li>
<li><a href="#orgf835665">2. Half-Guard</a>
<ul>
<li><a href="#org2bcd6a2">2.1. Top</a></li>
<li><a href="#orgbc81767">2.2. Bottom</a>
<ul>
<li><a href="#orgc35d5dd">2.2.1. Half-Guard roll from bottom to top (Roger Gracie Guard Study)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbf8ced2">3. Side Control</a>
<ul>
<li><a href="#orgb208262">3.1. Top</a></li>
<li><a href="#orga750da8">3.2. Bottom</a>
<ul>
<li><a href="#orgd664bea">3.2.1. Stone Squirrel Posture VanGuard side contol escape system</a></li>
<li><a href="#org0145fd8">3.2.2. Armpit/Prayer Posture (APP)</a></li>
<li><a href="#orgb4b289d">3.2.3. Hands in Front Posture</a></li>
<li><a href="#org4402d77">3.2.4. Inside Arm Down Posture</a></li>
<li><a href="#orgbe21e1d">3.2.5. Submissions from Bottom</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd7bd3ec">4. Scarf</a>
<ul>
<li><a href="#org3af6dd4">4.1. Top</a></li>
<li><a href="#org7f9acd3">4.2. Bottom</a></li>
</ul>
</li>
<li><a href="#orgff91a0b">5. North/South</a>
<ul>
<li><a href="#org0c30a32">5.1. Top</a></li>
<li><a href="#org7071385">5.2. Bottom</a></li>
</ul>
</li>
<li><a href="#orgc0d3130">6. Knee on Belly</a>
<ul>
<li><a href="#org136412f">6.1. Top</a></li>
<li><a href="#orgd0ec41c">6.2. Bottom</a></li>
</ul>
</li>
<li><a href="#orga00156b">7. Back</a>
<ul>
<li><a href="#org4757a57">7.1. Top</a></li>
<li><a href="#orgcf7d664">7.2. Bottom</a></li>
</ul>
</li>
<li><a href="#org11eaa76">8. Mount</a>
<ul>
<li><a href="#org1e0ea97">8.1. Top</a></li>
<li><a href="#org2370ed7">8.2. Bottom</a></li>
</ul>
</li>
<li><a href="#org293dc84">9. Notes</a>
<ul>
<li><a href="#org5326fe2">9.1. Concepts</a>
<ul>
<li><a href="#org6c10825">9.1.1. On a line</a></li>
<li><a href="#org12751bd">9.1.2. Hip Heist</a></li>
<li><a href="#orgdc6c4e7">9.1.3. Stone Squirrel</a></li>
<li><a href="#org21878d9">9.1.4. Top Single leg</a></li>
<li><a href="#orgc4043ec">9.1.5. Bottom Single leg</a></li>
</ul>
</li>
<li><a href="#org975416d">9.2. Styles</a>
<ul>
<li><a href="#orge65bc1a">9.2.1. How to Roll as a purple belt by Eddie Fyvie</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The following is my current gameplan for bjj. This is mostly based on notes I have made from watching various youtube videos. My idea is to actually take the videos I watch seriously and drill those specific techniques instead of just collecting and forgetting move after move.
</p>

<div id="outline-container-org375b0f3" class="outline-2">
<h2 id="org375b0f3"><span class="section-number-2">1</span> Guard</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orge23619d" class="outline-3">
<h3 id="orge23619d"><span class="section-number-3">1.1</span> Top</h3>
<div class="outline-text-3" id="text-1-1">
</div><ol class="org-ol"><li><a id="org73e2041"></a>Open Guard<br  /><ol class="org-ol"><li><a id="org0d4ecaa"></a><a href="https://www.youtube.com/watch?v=APzRFmKyIhQ">Passing Open Guard -josh robinson</a><br  /><div class="outline-text-7" id="text-1-1-0-0-1-1">
<p>
In this link from Ronin Submissions Josh Robinson, Josh explains how to establish a good position from open guard before allowing the opponent to control your hips or sleeves. Step one is to establish a knee ride on the thigh of the opponent and allow the knee shield. This immobilizes the hips and stops inversions. Step two is to connect your hands and arms under the thighs and pass to one side or the other.
</p>
</div></li></ol></li>
<li><a id="orgec63923"></a>Closed Guard Passing<br  /><ol class="org-ol"><li><a id="orga205ee7"></a><a href="https://www.youtube.com/watch?v=DZL7pmQjmyU&amp;list=PLLvUtPaoHJDIXWuF18ZKOC-HNdNhuMqks&amp;index=2">Basic Guard Passing System (VanGuard Gym Coach Doug)</a><br  /><ol class="org-ol"><li><a id="org593c977"></a>Basic Guard Break (Guard Break)<br  /><ol class="org-ol"><li><a id="org876bd3a"></a>Double Meathead Pass<br  /><div class="outline-text-9" id="text-1-1-0-0-2-1-1-1">
<p>
After the Basic Guard break you have moved away from OPs hips. This allows OP to put his feet on your hips and create space and control.
The Double Meathead Pass answers this problem. Your arms pummel under the OPs legs and you connect your hands in front of his hips.
This pops OPs feet off of your hips.
Next, pull OP up on your lap to isoloate OPs hips. Grab the far side lapel in the direction you want to pass.
Stand up and drive into the legs as you walk around to the side.
Drive your shoulder into the legs with good posture to pass.
The far side lapel grip will prevent the OP from rolling away.
</p>

<p>
Note: Doug recommends not grabbing the collar. (This is what I do most times). The collar grab opens you up to the elbow push escape while the lower lapel grip controls the hips better and is not as suseptable to the elbow push because your arm is not as extended.
</p>
</div></li>
<li><a id="orgee6877c"></a>Shoulder in Belly Pass (Over/Under pass)<br  /><div class="outline-text-9" id="text-1-1-0-0-2-1-1-2">
<p>
From the break, You grab one pant grip at OPs knee and the other arm underhooks the leg.
Keep both grips while you drop your shoulder into OPs missection and walk around the guard.
After your knee is established on the hip you are cleared to move the knee grip to a crossface control of the neck.
After that is established you can release the underhook of the leg to secure side control.
Note: You are on your toes and not your knees during this pass
</p>
</div></li></ol></li>
<li><a id="org10fa9d5"></a>Violator/Combat Knee Break<br  /><div class="outline-text-8" id="text-1-1-0-0-2-1-2">
<p>
From closed guard establish double bicep control on the OPs closed guard. Stand up and stack the OPs guard.
While standing adjust your feet so that your knee is lined up on OPs centerline.
Sit back into a combat base (forward leg knee up, back knee down)
This will break the guard open and leave you in a good base situation.
Depending on which way OPs shirmps or what side he leans to we will use either Knee Thru or Knee Slice Pass
</p>
</div>
<ol class="org-ol"><li><a id="org7a4b81a"></a>Knee Thru Pass<br  /><div class="outline-text-9" id="text-1-1-0-0-2-1-2-1">
<p>
Knee Thru means that we staple our knee over the OPs thigh on the same side (Right to Right, Left to Left)
</p>
<ol class="org-ol">
<li>As OP shrimps we staple the leg with our forward knee</li>
<li>At the same time, we reach for a crossface control of the neck and underhook OPs farside leg</li>
<li>Pin your knee to control the near side hip</li>
<li>Backstep with strong shoulder pressure and a deep crossface grabbing the back of the gi</li>
</ol>
<p>
4a. Extend your hips into the armpit to dominate the side
</p>
<ol class="org-ol">
<li>Replace your knee on the hip with your top side hand</li>
<li>Switch your knee from the hip to the armpit while pressing OPs face away with shoulder pressure.</li>
</ol>
</div></li>
<li><a id="org4828f16"></a>Cross Knee Pass (Knee Slice Pass)<br  /><div class="outline-text-9" id="text-1-1-0-0-2-1-2-2">
<p>
Cross Knee means we are going from Right to Left or Left to Right with the knee across OPs hips. The key to this pass is to get the underhook on the same side as our knee is coming from to avoid a backtake.
</p>
<ol class="org-ol">
<li>As OP shrimps we staple across to the opposite side of our knee.</li>
<li>Underhook the far side armpit while pulling up on the near side sleeve</li>
<li>Step around OPs bottom leg as you baseball slide into the pass with full pressure on your OP.</li>
<li>End at <a href="#orge23619d">Scarf Control Top</a></li>
</ol>
</div></li>
<li><a id="orgaf18501"></a>Turk Pass (Leg Weave)<br  /><div class="outline-text-9" id="text-1-1-0-0-2-1-2-3">
<p>
From OPs scissor guard (open guard with a setup for a scissor sweep, knee sheild top leg with a bottom leg outside my legs.
</p>
<ol class="org-ol">
<li>Weave your arm under the knee of the knee shield and grip on top of OPs bottom knee.</li>
<li>Get to your feet and stack into OP</li>
<li>Press forehead and shoulders down and forward to collapse OPs legs together</li>
<li>As you press your shoulder into OP, spring up and hop around the legs.</li>
</ol>
<p>
This kills OPs hips and limit his movement
</p>
<ol class="org-ol">
<li>Turn the leg weave hand the other way to make room at OPs hips</li>
<li>Place your bottom knee into the hip and finish the pass.</li>
<li>If OP gets the top knee in between before you finish the pass. Use the leg weave hand to cup the top knee fast and pull it away while you replace your knee and finish the pass.</li>
<li>If OPs legs are preventing the pass, keep the same grips and hop to the back side to finish the pass.</li>
</ol>
</div></li></ol></li></ol></li></ol></li></ol>
</div>
