bjjplan.html
<div id="outline-container-org98a10c6" class="outline-3">
<h3 id="org98a10c6"><span class="section-number-3">1.2</span> Bottom</h3>
<div class="outline-text-3" id="text-1-2">
</div><ol class="org-ol"><li><a id="orge6cef82"></a>Overhook Guard game<br  /><ol class="org-ol"><li><a id="orgde66fa7"></a>Vale Tudo Guard<br  /><ol class="org-ol"><li><a id="org2010b50"></a><a href="https://www.youtube.com/watch?v=CGDdWRRtGDw">Vale Tudo Guard Vale Tudo Guard -josh robinson</a> (similar to my overhook game with a better setup)<br  /><div class="outline-text-8" id="text-1-2-0-0-1-1-1">
<p>
Josh explains that you would use your wrists connecting to the back of the neck to break posture instead of pulling collars. I like this because I am getting spiderguard fingers from pulling lapels so if I can be less dependant on those grips it will be better for my hands. I will be able to use my grips for chokes instead of breaking posture as well. It also has the benefit of being able to translate to a no-gi game.
</p>
</div></li>

<li><a id="org3ad2cf1"></a><a href="https://www.youtube.com/watch?v=1t_0crasE_4">Vale Tudo Guard no-gi -josh robinson</a> (setup triangle, gogoplata and straight jacket)<br  /><div class="outline-text-8" id="text-1-2-0-0-1-1-2">
<p>
In this video Josh explains how to setup the Vale Tudo guard (from the hip instead of being flat on the back). Bicep control is better than wrist control. Feet on hips can be exchanged for a formal closed guard. The overhook keeps the posture broken with a collar tie at times. "Clear the head" means we get the forearm to the overhook side and the foot comes in front for a gogoplata. The triange is available because you are on your hip. The straightjacket submission follows the gogoplata setup when the arm defends the choke. The far arm is pulled through to increase pressure on the choke. This is similar to the collar choke with the far arm pulled across to allow the shoulder to finish the choke. This also leads to an omaplata choke.
</p>
</div></li>
<li><a id="org058c860"></a><a href="https://www.youtube.com/watch?v=X8Qhl-jmeNs">Closed Guard Arm-drag (Roger Gracie Guard Study)</a> (Arm-drag with 2 on 1 grip to setup, back-take, armbar or flower sweep)<br  /><div class="outline-text-8" id="text-1-2-0-0-1-1-3">
<p>
The guard is closed and you grab the ops sleve at the wrist and elbow. Using a bridge and a foot on the arm side hip, pull the elbow across your centerline to pin it the side. When the elbow is across teh centerline, three options are available depending on what the op does. 1. take the back 2. arm bar (scrambles into triangle, oomaplata etc) 3. sweep (flower sweep shown in the video)
</p>
</div>
<ol class="org-ol"><li><a id="org3dcd615"></a>Back-Take<br  /><div class="outline-text-9" id="text-1-2-0-0-1-1-3-1">
<p>
The backtake is availble by pushing the arm away from your center line as you crawl to the back. Be careful to not fall too far forward. In the video, Roger uses an underhook on the legs and strong collar control to stay tight to the op. Roger also tries to hand off the sleeve grip to the far side hand from the armpit. This creates a strong "gift-wrap" style grip around the back and it helps the back take.
</p>
</div></li>
<li><a id="org0168107"></a>Arm Bar<br  /><div class="outline-text-9" id="text-1-2-0-0-1-1-3-2">
<p>
The op will raise the head to avoid the backtake. Additionally the op will extend thier neck and use head pressue to prevent the backtake. When this happens, it is possible to go for the armbar instead. If the armbar fails be ready to scramble into the sweep, triangle or oomaplata. Before transitioning from the back take to the armbar, it is nessesary to get your hips out to the side. Roger also sets up the armbar with a far side collar grip. This allows him to anchor and helps get the foot in front of the face. It may also be useful if an opportunity for a choke happens. Keep the back take threat alive while setting up the armbar.
</p>

<p>
When Roger broke Jacare's arm he climbed his legs up into a high guard that covered the far side shoulder before he committed to the armbar. This allowed Jacare less time to react to the armbar before it was secured.
</p>
</div></li>
<li><a id="org38280ef"></a>Flower-sweep<br  /><div class="outline-text-9" id="text-1-2-0-0-1-1-3-3">
<p>
The control of the arm that comes with the 2 on 1 sleeve grip will deprive op of base on that side. The example of Roger using the flower sweep in this video is the same climbing guard that Roger used to armbar Jacare. The op had nee raised on the same side as the 2 on 1 arm that Roger controlled. While climbing up and threatening the armbar, Roger used the movement to underhook the ops far side leg (opposite of the controlled arm) and swept to mount. This would have worked with a gi grip as well if he could not get the underhook on the leg.
</p>
</div></li></ol></li>
<li><a id="orgd592021"></a><a href="https://www.youtube.com/watch?v=FP-qEk83DdQ">Cross-side collar grip (Kron Gracie Guard Study) loopchoke, armbar, anklepick</a><br  /></li></ol></li></ol></li>
<li><a id="orgbc94981"></a><a href="https://www.youtube.com/watch?annotation_id=annotation_263863977&amp;feature=iv&amp;src_vid=8F6meOljv-s&amp;v=tmGqgXnuNBE">Marcelo Garcia elbow push escape (Guard Retention)</a><br  /></li></ol>
</div>
</div>
<div id="outline-container-orgf835665" class="outline-2">
<h2 id="orgf835665"><span class="section-number-2">2</span> Half-Guard</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org2bcd6a2" class="outline-3">
<h3 id="org2bcd6a2"><span class="section-number-3">2.1</span> Top</h3>
</div>
<div id="outline-container-orgbc81767" class="outline-3">
<h3 id="orgbc81767"><span class="section-number-3">2.2</span> Bottom</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgc35d5dd" class="outline-4">
<h4 id="orgc35d5dd"><span class="section-number-4">2.2.1</span> <a href="https://youtu.be/X8Qhl-jmeNs?t=8m34s">Half-Guard roll from bottom to top (Roger Gracie Guard Study)</a></h4>
<div class="outline-text-4" id="text-2-2-1">
</div><ol class="org-ol"><li><a id="orga3e2b16"></a>From Bottom Half-Guard get perpendicular and reverse the position<br  /><div class="outline-text-5" id="text-2-2-1-1">
<p>
Roger gets an overhook on the trapped leg side from bottom half-guard. He is on his side with contol of the belt with his top hand and a unknown grip with his bottom hand. He could have the leg or hip. He plants his outside foot and upas hard while pulling up on the belt to get the ops weight foward while Roger gets his body perpendicular. He uses momentum before the upa to load the op and get him moving in the correct direction. Roger also uses the momentum from the upa to swing his outside leg up as he inverts into the roll.
</p>
</div></li></ol>
</div>
</div>
</div>
<div id="outline-container-orgbf8ced2" class="outline-2">
<h2 id="orgbf8ced2"><span class="section-number-2">3</span> Side Control</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgb208262" class="outline-3">
<h3 id="orgb208262"><span class="section-number-3">3.1</span> Top</h3>
</div>
<div id="outline-container-orga750da8" class="outline-3">
<h3 id="orga750da8"><span class="section-number-3">3.2</span> Bottom</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://www.youtube.com/watch?v=8F6meOljv-s&amp;index=1&amp;list=PLLvUtPaoHJDIXWuF18ZKOC-HNdNhuMqks">Side Control system from VanGuard Gym (Coach Doug Esposito)</a>
It is easy to defend if you only try to re-guard. You need to have various options for different situations. This system will give you a plan for escapes.
</p>
</div>

<div id="outline-container-orgd664bea" class="outline-4">
<h4 id="orgd664bea"><span class="section-number-4">3.2.1</span> Stone Squirrel Posture <a href="https://www.youtube.com/watch?v=8F6meOljv-s&amp;index=1&amp;list=PLLvUtPaoHJDIXWuF18ZKOC-HNdNhuMqks">VanGuard side contol escape system</a></h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The stone squirrel posture is a position from bottom side control. Your hands
control the opponents shoulder and your forearms and elbows frame in between
your chest and your opponent's chest. This frame allows you to raise your arms
over your head (trash truck style) to bring your opponent away from your chest.
Putting your forearms on the chest instead of on the neck gives you more
control. When combined with a bridge space is created that can be used in the positions that follow.
</p>
</div>

<ol class="org-ol"><li><a id="orge51e1f4"></a>Re-Guard<br  /><div class="outline-text-5" id="text-3-2-1-1">
<p>
From Stone Squirrel, feet close to hips, bridge into op and lift op back with a
frame. At the same time, shrimp to make room and insert a knee to take up the
space you created. Hook behind the leg or under the leg for a butterfly to re-guard
</p>
</div>
<ol class="org-ol"><li><a id="orgc154b9e"></a>Sweep<br  /><div class="outline-text-7" id="text-3-2-1-1-0-1">
<p>
If you have the overhook control from the guard and the ops posture is broken, you can sweep from guard to mount.
</p>
</div></li>
<li><a id="org2be17fa"></a>Armbar<br  /><div class="outline-text-7" id="text-3-2-1-1-0-2">
<p>
If you have a stong underhook on the other arm an armbar is available from the guard with your arm and head pinching the elbow of your opponent.
</p>
</div></li></ol></li>
