bjjplan.org
**** Bottom Single Leg to Side Control – Top/Offensive

From Stone Squirrel, frame with your forearms and elbows and bridge. Ensure that
your feet are not all the way into your hips, that space is needed to "hip
heist". Hip Heist means you thread your nearside foot under your far side leg
and turn belly down. At the same time, windshield wiper and pummel your far side arm to
create an underhook

**** Bump and Roll to Side Control – Top/Offensive
With one arm framed on the hip and the other arm under the chest in stone squirrel, lift and upa into the op to make room for your guard. The op is pressing back to flatten you out. Using this momentum, scoot your hips underneath your op with a hip shovel (do not just roll without getting under the op). The frame on the hip is key to making this work.
***** If OP posts on his hand
The posting opens the OP up so that we can try to reguard or move into another transition. We have to drill all of these defenses so we can link one technique to the others in the system.
**** Rainbow Roll to Side Control – Top/Offensive
The crossface from side control gives us an opportnity to trap that arm. If we can get parrell to the OP we can roll to sweep to top side control from that posistion. This happens naturally when OP is going to [[*North/South][North/South]]. If we feel the bottom arm transerring to 100 kilos that is a cue that OP is going to North/South. Otherwise, we can move ourselves into a North/South posture to get OP "on a line" by changing the angle. Our hand that is not trapping the crossface arm is going over OPs back to grab his belt. We have to shrimp away from OP and put your armpit on OPs shoulder.
*** Armpit/Prayer Posture (APP)
Armpit/Prayer Posture is similar to Stone Squirrel. The farside hand is in the armpit instead of being at the shoulder. This makes it harder to peek your elbow out for the far side underhook but it allows access to the top single leg. HipBump to move farside hand under the armpit.
**** Top Leg Single to Side Control – Top/Offensive
From APP, bump and shrimp to get rid of the crossface and make OP "float" on your forearms by lifting your forearms to fill the space you created with the bump.
**** Elbow Push to Open Guard
**** All Stone Squirrel Escapes
*** Hands in Front Posture
**** Turn Away to Turtle 1 – Bottom/Defensive, sit thru to Turtle 2 – Top Offensive
**** Monkey or Granby Roll to [[*Bottom][Bottom Guard]]
*** Inside Arm Down Posture
**** Pant Grab to Guard or Half-Guard – Bottom
**** Jail Break to Butterfly Guard – Bottom
**** Ghost to Turtle 1 – Top/Offensive
*** Submissions from Bottom
**** [[https://www.youtube.com/watch?v=HLcM9pbELHk][no-gi baseballbat and ezekiel from bottom - josh robinson]]
**** Last resort                                                :subs:bottom:
SCHEDULED: <2016-11-26 Sat>
:PROPERTIES:
:CREATED:  [2016-11-26 Sat 17:14]
:END:

You should try for escapes instead of submissions from inferior positions. We cannot assume that every encounter will be 1 on 1 in a controlled environment. Being in top position gives you a better chance to bail out and run if nessesary.

* Scarf
** Top
** Bottom
* North/South
** Top
** Bottom
* Knee on Belly
** Top
** Bottom
* Back
** Top
** Bottom
* Mount
** Top
** Bottom
* Notes
** Concepts
*** On a line
Coach Doug uses the term On a line in his side control series. This means that the OP is in a position that does not allow him to base on one side. In judo this can be called a dead angle.
*** Hip Heist
*** Stone Squirrel
*** Top Single leg
Closest to your head instead of closest to your hips
*** Bottom Single leg
Closest to your hips instead of your head. You need to hip heist to get this leg.
** Styles
*** [[https://www.jiujitsutimes.com/purple-belt-k-rolling-belt/][How to Roll as a purple belt]] by Eddie Fyvie
**** Crush you opponents: Focus on using heavy weight and really “crushing” on top.
**** Don’t finish anyone: Try to roll in a way where you catch and release submissions. Focus mainly on positions.
**** Don’t give anything: Don’t give an inch to anyone.
**** Keep it playful, but with a purpose: Keep it playful, but adhere to the principles and pick a goal.
**** Float: Don’t hold positions long; hop around and move quickly.
**** Allow bad positions, but with a purpose: Allow bad positions with the purpose of escaping and defending. Find comfort in discomfort.
**** Go for a “marathon round”: Just roll. Roll so long you have to change your attire. Time limits = sport. No time limits = life
