bjjplan.html
<li><a id="orgb78f7f2"></a>Bottom Single Leg to Side Control – Top/Offensive<br  /><div class="outline-text-5" id="text-3-2-1-2">
<p>
From Stone Squirrel, frame with your forearms and elbows and bridge. Ensure that
your feet are not all the way into your hips, that space is needed to "hip
heist". Hip Heist means you thread your nearside foot under your far side leg
and turn belly down. At the same time, windshield wiper and pummel your far side arm to
create an underhook
</p>
</div></li>

<li><a id="orged5bfff"></a>Bump and Roll to Side Control – Top/Offensive<br  /><div class="outline-text-5" id="text-3-2-1-3">
<p>
With one arm framed on the hip and the other arm under the chest in stone squirrel, lift and upa into the op to make room for your guard. The op is pressing back to flatten you out. Using this momentum, scoot your hips underneath your op with a hip shovel (do not just roll without getting under the op). The frame on the hip is key to making this work.
</p>
</div>
<ol class="org-ol"><li><a id="org2e7054b"></a>If OP posts on his hand<br  /><div class="outline-text-6" id="text-3-2-1-3-1">
<p>
The posting opens the OP up so that we can try to reguard or move into another transition. We have to drill all of these defenses so we can link one technique to the others in the system.
</p>
</div></li></ol></li>
<li><a id="org83b5b4e"></a>Rainbow Roll to Side Control – Top/Offensive<br  /><div class="outline-text-5" id="text-3-2-1-4">
<p>
The crossface from side control gives us an opportnity to trap that arm. If we can get parrell to the OP we can roll to sweep to top side control from that posistion. This happens naturally when OP is going to <a href="#orgff91a0b">North/South</a>. If we feel the bottom arm transerring to 100 kilos that is a cue that OP is going to North/South. Otherwise, we can move ourselves into a North/South posture to get OP "on a line" by changing the angle. Our hand that is not trapping the crossface arm is going over OPs back to grab his belt. We have to shrimp away from OP and put your armpit on OPs shoulder.
</p>
</div></li></ol>
</div>
<div id="outline-container-org0145fd8" class="outline-4">
<h4 id="org0145fd8"><span class="section-number-4">3.2.2</span> Armpit/Prayer Posture (APP)</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Armpit/Prayer Posture is similar to Stone Squirrel. The farside hand is in the armpit instead of being at the shoulder. This makes it harder to peek your elbow out for the far side underhook but it allows access to the top single leg. HipBump to move farside hand under the armpit.
</p>
</div>
<ol class="org-ol"><li><a id="org75a78b6"></a>Top Leg Single to Side Control – Top/Offensive<br  /><div class="outline-text-5" id="text-3-2-2-1">
<p>
From APP, bump and shrimp to get rid of the crossface and make OP "float" on your forearms by lifting your forearms to fill the space you created with the bump.
</p>
</div></li>
<li><a id="org79eac99"></a>Elbow Push to Open Guard<br  /></li>
<li><a id="orgdb51854"></a>All Stone Squirrel Escapes<br  /></li></ol>
</div>
<div id="outline-container-orgb4b289d" class="outline-4">
<h4 id="orgb4b289d"><span class="section-number-4">3.2.3</span> Hands in Front Posture</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ol class="org-ol"><li><a id="org8740910"></a>Turn Away to Turtle 1 – Bottom/Defensive, sit thru to Turtle 2 – Top Offensive<br  /></li>
<li><a id="org5e7c1de"></a>Monkey or Granby Roll to <a href="#org98a10c6">Bottom Guard</a><br  /></li></ol>
</div>
<div id="outline-container-org4402d77" class="outline-4">
<h4 id="org4402d77"><span class="section-number-4">3.2.4</span> Inside Arm Down Posture</h4>
<div class="outline-text-4" id="text-3-2-4">
</div><ol class="org-ol"><li><a id="org5899eb9"></a>Pant Grab to Guard or Half-Guard – Bottom<br  /></li>
<li><a id="orgd4fd183"></a>Jail Break to Butterfly Guard – Bottom<br  /></li>
<li><a id="orge767359"></a>Ghost to Turtle 1 – Top/Offensive<br  /></li></ol>
</div>
<div id="outline-container-orgbe21e1d" class="outline-4">
<h4 id="orgbe21e1d"><span class="section-number-4">3.2.5</span> Submissions from Bottom</h4>
<div class="outline-text-4" id="text-3-2-5">
</div><ol class="org-ol"><li><a id="org6575148"></a><a href="https://www.youtube.com/watch?v=HLcM9pbELHk">no-gi baseballbat and ezekiel from bottom - josh robinson</a><br  /></li>
<li><a id="org8fb98c3"></a>Last resort&#xa0;&#xa0;&#xa0;<span class="tag"><span class="subs">subs</span>&#xa0;<span class="bottom">bottom</span></span><br  /><div class="outline-text-5" id="text-3-2-5-2">
<p>
You should try for escapes instead of submissions from inferior positions. We cannot assume that every encounter will be 1 on 1 in a controlled environment. Being in top position gives you a better chance to bail out and run if nessesary.
</p>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgd7bd3ec" class="outline-2">
<h2 id="orgd7bd3ec"><span class="section-number-2">4</span> Scarf</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org3af6dd4" class="outline-3">
<h3 id="org3af6dd4"><span class="section-number-3">4.1</span> Top</h3>
</div>
<div id="outline-container-org7f9acd3" class="outline-3">
<h3 id="org7f9acd3"><span class="section-number-3">4.2</span> Bottom</h3>
</div>
</div>
<div id="outline-container-orgff91a0b" class="outline-2">
<h2 id="orgff91a0b"><span class="section-number-2">5</span> North/South</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org0c30a32" class="outline-3">
<h3 id="org0c30a32"><span class="section-number-3">5.1</span> Top</h3>
</div>
<div id="outline-container-org7071385" class="outline-3">
<h3 id="org7071385"><span class="section-number-3">5.2</span> Bottom</h3>
</div>
</div>
<div id="outline-container-orgc0d3130" class="outline-2">
<h2 id="orgc0d3130"><span class="section-number-2">6</span> Knee on Belly</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-org136412f" class="outline-3">
<h3 id="org136412f"><span class="section-number-3">6.1</span> Top</h3>
</div>
<div id="outline-container-orgd0ec41c" class="outline-3">
<h3 id="orgd0ec41c"><span class="section-number-3">6.2</span> Bottom</h3>
</div>
</div>
<div id="outline-container-orga00156b" class="outline-2">
<h2 id="orga00156b"><span class="section-number-2">7</span> Back</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org4757a57" class="outline-3">
<h3 id="org4757a57"><span class="section-number-3">7.1</span> Top</h3>
</div>
<div id="outline-container-orgcf7d664" class="outline-3">
<h3 id="orgcf7d664"><span class="section-number-3">7.2</span> Bottom</h3>
</div>
</div>
<div id="outline-container-org11eaa76" class="outline-2">
<h2 id="org11eaa76"><span class="section-number-2">8</span> Mount</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-org1e0ea97" class="outline-3">
<h3 id="org1e0ea97"><span class="section-number-3">8.1</span> Top</h3>
</div>
<div id="outline-container-org2370ed7" class="outline-3">
<h3 id="org2370ed7"><span class="section-number-3">8.2</span> Bottom</h3>
</div>
</div>
<div id="outline-container-org293dc84" class="outline-2">
<h2 id="org293dc84"><span class="section-number-2">9</span> Notes</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org5326fe2" class="outline-3">
<h3 id="org5326fe2"><span class="section-number-3">9.1</span> Concepts</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-org6c10825" class="outline-4">
<h4 id="org6c10825"><span class="section-number-4">9.1.1</span> On a line</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
Coach Doug uses the term On a line in his side control series. This means that the OP is in a position that does not allow him to base on one side. In judo this can be called a dead angle.
</p>
</div>
</div>
<div id="outline-container-org12751bd" class="outline-4">
<h4 id="org12751bd"><span class="section-number-4">9.1.2</span> Hip Heist</h4>
</div>
<div id="outline-container-orgdc6c4e7" class="outline-4">
<h4 id="orgdc6c4e7"><span class="section-number-4">9.1.3</span> Stone Squirrel</h4>
</div>
<div id="outline-container-org21878d9" class="outline-4">
<h4 id="org21878d9"><span class="section-number-4">9.1.4</span> Top Single leg</h4>
<div class="outline-text-4" id="text-9-1-4">
<p>
Closest to your head instead of closest to your hips
</p>
</div>
</div>
<div id="outline-container-orgc4043ec" class="outline-4">
<h4 id="orgc4043ec"><span class="section-number-4">9.1.5</span> Bottom Single leg</h4>
<div class="outline-text-4" id="text-9-1-5">
<p>
Closest to your hips instead of your head. You need to hip heist to get this leg.
</p>
</div>
</div>
</div>
<div id="outline-container-org975416d" class="outline-3">
<h3 id="org975416d"><span class="section-number-3">9.2</span> Styles</h3>
<div class="outline-text-3" id="text-9-2">
</div><div id="outline-container-orge65bc1a" class="outline-4">
<h4 id="orge65bc1a"><span class="section-number-4">9.2.1</span> <a href="https://www.jiujitsutimes.com/purple-belt-k-rolling-belt/">How to Roll as a purple belt</a> by Eddie Fyvie</h4>
<div class="outline-text-4" id="text-9-2-1">
</div><ol class="org-ol"><li><a id="org1f81f81"></a>Crush you opponents: Focus on using heavy weight and really “crushing” on top.<br  /></li>
<li><a id="org08379b6"></a>Don’t finish anyone: Try to roll in a way where you catch and release submissions. Focus mainly on positions.<br  /></li>
<li><a id="org86aeafd"></a>Don’t give anything: Don’t give an inch to anyone.<br  /></li>
<li><a id="orge85ccea"></a>Keep it playful, but with a purpose: Keep it playful, but adhere to the principles and pick a goal.<br  /></li>
<li><a id="orga570244"></a>Float: Don’t hold positions long; hop around and move quickly.<br  /></li>
<li><a id="orgdc02721"></a>Allow bad positions, but with a purpose: Allow bad positions with the purpose of escaping and defending. Find comfort in discomfort.<br  /></li>
<li><a id="org16ef16a"></a>Go for a “marathon round”: Just roll. Roll so long you have to change your attire. Time limits = sport. No time limits = life<br  /></li>
