bjjplan.html
<li><a id="orgb55d6b6"></a>Trade moves for concepts<br  /><div class="outline-text-5" id="text-9-2-1-8">
<p>
You should be utilizing the principles and concepts passed down by our BJJ forefathers from DAY ONE of your training!
</p>

<p>
However, at the purple belt, it is time to kick your understanding of concepts into high gear.
</p>

<p>
Imagine it like art; white belt and blue belt are learning how the artists’ tools work. You learn how to draw, paint, sketch, and at the end of blue belt, you have picked your “style” of art. The white belt and blue belt level doesn’t allow much room for personal thought. You need a concrete foundation and must master the artists’ tools!
</p>

<p>
When you reach purple belt, you have earned the right to start exploring the “abstract”. You should always experiment and stay fascinated by the difficulty!
</p>

<p>
“You can listen to me now or wait until you are 65.” – Frank Popolizio
</p>

<p>
You are now freeing yourself from the stress of mastering the basics and can start opening up and allowing the abstract form of rolling to take shape. You should be seeing the “big picture” of jiu-jitsu much more clearly and have blended the hundreds of techniques you know into concepts that allow you to start applying them rapidly. You must see the “blend” of techniques in the various situations.
</p>

<p>
The figurative samurai sword has been sharpened once you hit black belt. The purple belt has acquired the sword and has the skills, but still needs to smooth out the blade for extreme precision.
</p>
</div></li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brian Cronmiller</p>
<p class="date">Created: 2016-11-29 Tue 10:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
